import pandas as pd

DF = pd.read_excel('data_test.xlsx')
# DF = pd.read_excel('data.xlsx')
CITIES = [{"label": city, "value": city} for city in DF["town"].unique()]
START_DATE = DF['dtime'][0]
END_DATE = DF['dtime'][len(DF) - 1]
PRICE = 2.5

OUTSIDE_TEMPERATURES = {
    "Вінниця": -21,
    "Дніпропетровськ": -23,
    "Донецьк": -23,
    "Житомир": -22,
    "Запоріжжя": -22,
    "Бердянськ": -19,
    "Івано-Франківськ": -20,
    "Київ": -22,
    "Кропивницький": -22,
    "Луганськ": -25,
    "Луцьк": -20,
    "Львів": -19,
    "Миколаїв": -20,
    "Одеса": -18,
    "Полтава": -23,
    "Рівне": -21,
    "Сімферополь": -16,
    "Суми": -24,
    "Тернопіль": -21,
    "Ужгород": -28,
    "Харків": -23,
    "Херсон": -19,
    "Хмельницький": -21,
    "Черкаси": -22,
    "Чернігів": -23,
    "Чернівці": -20
}
